IDENTIFICATION DIVISION.
PROGRAM-ID. RESISTANCE-CALCULATOR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-CODE-ACCES      PIC X(4).
01 WS-NOM             PIC X(20).
01 WS-NOMBRE-1        PIC 9(8)V99.
01 WS-NOMBRE-2        PIC 9(8)V99.
01 WS-RESULTAT        PIC 9(10)V99.
01 WS-CHOIX-CONTINUER PIC X VALUE 'O'.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
DISPLAY '--- SYSTEME DE LA RESISTANCE ---'.
DISPLAY 'ENTRER CODE DACCES RESEAU :'.
ACCEPT WS-CODE-ACCES.

       IF WS-CODE-ACCES = '2026' THEN
           DISPLAY 'IDENTITE CONFIRMEE. ACCES AUTORISE.'
       ELSE
           DISPLAY 'CODE INCORRECT. VERROUILLAGE.'
           STOP RUN
       END-IF.

       PERFORM CALCUL-RESISTANCE UNTIL WS-CHOIX-CONTINUER = 'N' OR WS-CHOIX-CONTINUER = 'n'.
       STOP RUN.

   CALCUL-RESISTANCE.
       DISPLAY 'IDENTIFICATION REQUISE... ENTRER NOM :'.
       ACCEPT WS-NOM.
       DISPLAY 'BIENVENUE, ' FUNCTION TRIM(WS-NOM) '!'.
       DISPLAY 'ENTREZ LA PREMIERE VALEUR :'.
       ACCEPT WS-NOMBRE-1.
       DISPLAY 'ENTREZ LA DEUXIEME VALEUR :'.
       ACCEPT WS-NOMBRE-2.
       COMPUTE WS-RESULTAT = WS-NOMBRE-1 + WS-NOMBRE-2.
       DISPLAY 'RESULTAT : ' WS-RESULTAT.
       DISPLAY 'AUTRE OPERATION ? (O/N) :'.
       ACCEPT WS-CHOIX-CONTINUER.
