>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. VICTOIRE.
AUTHOR.      Expert Software Developer.
DATE-WRITTEN. 2026-04-12.
*>
ENVIRONMENT DIVISION.
*>
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MESSAGE PIC X(40) VALUE "MISSION REUSSIE : COBOL PRO 2.5 EN PLACE".
*>
PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM AFFICHER-MESSAGE.
    STOP RUN.

AFFICHER-MESSAGE.
    DISPLAY WS-MESSAGE.
